package info.androidhive.WeatherApp.database;

import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.widget.TextView;

import info.androidhive.WeatherApp.R;

import java.util.List;

public class DatabaseWork extends AppCompatActivity {

    TextView textView;

    int check = 0;

    int id;
    @Override
    protected void onCreate(Bundle savedInstanceState)
    {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_database_work);

        Intent ii = getIntent();
        Bundle ib = ii.getExtras();

        id = (Integer)ib.get("id");
        //id = 803;
        StringBuilder sb = new StringBuilder();
        sb.append("");
        sb.append(id);
        String strI = sb.toString();
        textView = (TextView)findViewById(R.id.textDatabase);

        DatabaseHandler db = new DatabaseHandler(this);

        List<Contact> contactsi = db.getAllContacts(id);
        // textView.setText("\ni = " + i);
        String logs="";
        for (Contact cn : contactsi)
        {
            //logs +=cn.getDescription();
            // Writing Contacts to log
            // Log.d("Name: ", log);
            check = cn.getKeyid();

        }

        if(check==0)
        {
            db.addContact(new Contact(201,"বজ্রপাত সহ   বৃষ্টি হতে পারে।  বৃষ্টির পরিমাণ বাড়তে থাকলে ,  পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। ধান জাতীয় শস্য পাকতে শুরু করলে যথাসম্ভব রক্ষণাবেক্ষণ বাড়িয়ে  দিতে হবে।   খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । বজ্রপাতের ক্ষেত্রে গবাদিপশু সহ আপনাকেও খোলা মাঠে যথাসম্ভব কম অবস্থান নিশ্চিত করতে হবে । "));
            db.addContact(new Contact(202,"বজ্রপাত সহ   বৃষ্টি হতে পারে।  বৃষ্টির পরিমাণ বাড়তে থাকলে ,  পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। ধান জাতীয় শস্য পাকতে শুরু করলে যথাসম্ভব রক্ষণাবেক্ষণ বাড়িয়ে  দিতে হবে।   খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । বজ্রপাতের ক্ষেত্রে গবাদিপশু সহ আপনাকেও খোলা মাঠে যথাসম্ভব কম অবস্থান নিশ্চিত করতে হবে । "));
            db.addContact(new Contact(210,"বজ্রপাত সহ   বৃষ্টি হতে পারে।  বৃষ্টির পরিমাণ বাড়তে থাকলে ,  পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। ধান জাতীয় শস্য পাকতে শুরু করলে যথাসম্ভব রক্ষণাবেক্ষণ বাড়িয়ে  দিতে হবে।   খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । বজ্রপাতের ক্ষেত্রে গবাদিপশু সহ আপনাকেও খোলা মাঠে যথাসম্ভব কম অবস্থান নিশ্চিত করতে হবে । "));
            db.addContact(new Contact(211,"বজ্রপাত সহ   বৃষ্টি হতে পারে।  বৃষ্টির পরিমাণ বাড়তে থাকলে ,  পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। ধান জাতীয় শস্য পাকতে শুরু করলে যথাসম্ভব রক্ষণাবেক্ষণ বাড়িয়ে  দিতে হবে।   খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । বজ্রপাতের ক্ষেত্রে গবাদিপশু সহ আপনাকেও খোলা মাঠে যথাসম্ভব কম অবস্থান নিশ্চিত করতে হবে । "));
            db.addContact(new Contact(212,"বজ্রপাত সহ   বৃষ্টি হতে পারে।  বৃষ্টির পরিমাণ বাড়তে থাকলে ,  পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। ধান জাতীয় শস্য পাকতে শুরু করলে যথাসম্ভব রক্ষণাবেক্ষণ বাড়িয়ে  দিতে হবে।   খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । বজ্রপাতের ক্ষেত্রে গবাদিপশু সহ আপনাকেও খোলা মাঠে যথাসম্ভব কম অবস্থান নিশ্চিত করতে হবে । "));
            db.addContact(new Contact(221,"বজ্রপাত সহ   বৃষ্টি হতে পারে।  বৃষ্টির পরিমাণ বাড়তে থাকলে ,  পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। ধান জাতীয় শস্য পাকতে শুরু করলে যথাসম্ভব রক্ষণাবেক্ষণ বাড়িয়ে  দিতে হবে।   খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । বজ্রপাতের ক্ষেত্রে গবাদিপশু সহ আপনাকেও খোলা মাঠে যথাসম্ভব কম অবস্থান নিশ্চিত করতে হবে । "));
            db.addContact(new Contact(230,"বজ্রপাত সহ   বৃষ্টি হতে পারে।  বৃষ্টির পরিমাণ বাড়তে থাকলে ,  পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। ধান জাতীয় শস্য পাকতে শুরু করলে যথাসম্ভব রক্ষণাবেক্ষণ বাড়িয়ে  দিতে হবে।   খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । বজ্রপাতের ক্ষেত্রে গবাদিপশু সহ আপনাকেও খোলা মাঠে যথাসম্ভব কম অবস্থান নিশ্চিত করতে হবে । "));
            db.addContact(new Contact(231,"বজ্রপাত সহ   বৃষ্টি হতে পারে।  বৃষ্টির পরিমাণ বাড়তে থাকলে ,  পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। ধান জাতীয় শস্য পাকতে শুরু করলে যথাসম্ভব রক্ষণাবেক্ষণ বাড়িয়ে  দিতে হবে।   খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । বজ্রপাতের ক্ষেত্রে গবাদিপশু সহ আপনাকেও খোলা মাঠে যথাসম্ভব কম অবস্থান নিশ্চিত করতে হবে । "));

            db.addContact(new Contact(232,"বজ্রপাত সহ   বৃষ্টি হতে পারে।  বৃষ্টির পরিমাণ বাড়তে থাকলে ,  পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। ধান জাতীয় শস্য পাকতে শুরু করলে যথাসম্ভব রক্ষণাবেক্ষণ বাড়িয়ে  দিতে হবে।   খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । বজ্রপাতের ক্ষেত্রে গবাদিপশু সহ আপনাকেও খোলা মাঠে যথাসম্ভব কম অবস্থান নিশ্চিত করতে হবে । "));
            db.addContact(new Contact(200,"বজ্রপাত সহ   বৃষ্টি হতে পারে।  বৃষ্টির পরিমাণ বাড়তে থাকলে ,  পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। ধান জাতীয় শস্য পাকতে শুরু করলে যথাসম্ভব রক্ষণাবেক্ষণ বাড়িয়ে  দিতে হবে।   খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । বজ্রপাতের ক্ষেত্রে গবাদিপশু সহ আপনাকেও খোলা মাঠে যথাসম্ভব কম অবস্থান নিশ্চিত করতে হবে । "));
            db.addContact(new Contact(300,"গুড়ি গুড়ি  বৃষ্টি হতে পারে। সেক্ষেত্রে  বাড়তি সেচ দেবার প্রয়োজন পড়বেনা। বৃষ্টির পরিমাণ বাড়তে থাকলে ,  পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। ধান জাতীয় শস্য পাকতে শুরু করলে যথাসম্ভব রক্ষণাবেক্ষণ বাড়িয়ে  দিতে হবে।   খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । গবাদিপশুর ক্ষেত্রে ও অনুরূপ ব্যবস্থা নিতে হবে । "));
            db.addContact(new Contact(301,"গুড়ি গুড়ি  বৃষ্টি হতে পারে। সেক্ষেত্রে  বাড়তি সেচ দেবার প্রয়োজন পড়বেনা। বৃষ্টির পরিমাণ বাড়তে থাকলে ,  পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। ধান জাতীয় শস্য পাকতে শুরু করলে যথাসম্ভব রক্ষণাবেক্ষণ বাড়িয়ে  দিতে হবে।   খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । গবাদিপশুর ক্ষেত্রে ও অনুরূপ ব্যবস্থা নিতে হবে । "));
            db.addContact(new Contact(302,"গুড়ি গুড়ি  বৃষ্টি হতে পারে। সেক্ষেত্রে  বাড়তি সেচ দেবার প্রয়োজন পড়বেনা। বৃষ্টির পরিমাণ বাড়তে থাকলে ,  পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। ধান জাতীয় শস্য পাকতে শুরু করলে যথাসম্ভব রক্ষণাবেক্ষণ বাড়িয়ে  দিতে হবে।   খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । গবাদিপশুর ক্ষেত্রে ও অনুরূপ ব্যবস্থা নিতে হবে । "));
            db.addContact(new Contact(310,"গুড়ি গুড়ি  বৃষ্টি হতে পারে। সেক্ষেত্রে  বাড়তি সেচ দেবার প্রয়োজন পড়বেনা। বৃষ্টির পরিমাণ বাড়তে থাকলে ,  পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। ধান জাতীয় শস্য পাকতে শুরু করলে যথাসম্ভব রক্ষণাবেক্ষণ বাড়িয়ে  দিতে হবে।   খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । গবাদিপশুর ক্ষেত্রে ও অনুরূপ ব্যবস্থা নিতে হবে । "));
            db.addContact(new Contact(311,"গুড়ি গুড়ি  বৃষ্টি হতে পারে। সেক্ষেত্রে  বাড়তি সেচ দেবার প্রয়োজন পড়বেনা। বৃষ্টির পরিমাণ বাড়তে থাকলে ,  পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। ধান জাতীয় শস্য পাকতে শুরু করলে যথাসম্ভব রক্ষণাবেক্ষণ বাড়িয়ে  দিতে হবে।   খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । গবাদিপশুর ক্ষেত্রে ও অনুরূপ ব্যবস্থা নিতে হবে । "));
            db.addContact(new Contact(312,"গুড়ি গুড়ি  বৃষ্টি হতে পারে। সেক্ষেত্রে  বাড়তি সেচ দেবার প্রয়োজন পড়বেনা। বৃষ্টির পরিমাণ বাড়তে থাকলে ,  পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। ধান জাতীয় শস্য পাকতে শুরু করলে যথাসম্ভব রক্ষণাবেক্ষণ বাড়িয়ে  দিতে হবে।   খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । গবাদিপশুর ক্ষেত্রে ও অনুরূপ ব্যবস্থা নিতে হবে । "));
            db.addContact(new Contact(313,"গুড়ি গুড়ি  বৃষ্টি হতে পারে। সেক্ষেত্রে  বাড়তি সেচ দেবার প্রয়োজন পড়বেনা। বৃষ্টির পরিমাণ বাড়তে থাকলে ,  পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। ধান জাতীয় শস্য পাকতে শুরু করলে যথাসম্ভব রক্ষণাবেক্ষণ বাড়িয়ে  দিতে হবে।   খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । গবাদিপশুর ক্ষেত্রে ও অনুরূপ ব্যবস্থা নিতে হবে । "));
            db.addContact(new Contact(314,"গুড়ি গুড়ি  বৃষ্টি হতে পারে। সেক্ষেত্রে  বাড়তি সেচ দেবার প্রয়োজন পড়বেনা। বৃষ্টির পরিমাণ বাড়তে থাকলে ,  পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। ধান জাতীয় শস্য পাকতে শুরু করলে যথাসম্ভব রক্ষণাবেক্ষণ বাড়িয়ে  দিতে হবে।   খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । গবাদিপশুর ক্ষেত্রে ও অনুরূপ ব্যবস্থা নিতে হবে । "));
            db.addContact(new Contact(321,"গুড়ি গুড়ি  বৃষ্টি হতে পারে। সেক্ষেত্রে  বাড়তি সেচ দেবার প্রয়োজন পড়বেনা। বৃষ্টির পরিমাণ বাড়তে থাকলে ,  পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। ধান জাতীয় শস্য পাকতে শুরু করলে যথাসম্ভব রক্ষণাবেক্ষণ বাড়িয়ে  দিতে হবে।   খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । গবাদিপশুর ক্ষেত্রে ও অনুরূপ ব্যবস্থা নিতে হবে । "));

            db.addContact(new Contact(521,"থেমে থেমে বেশ জোরে  বৃষ্টি হতে পারে। সেক্ষেত্রে  বাড়তি সেচ দেবার প্রয়োজন পড়বেনা। পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । গবাদিপশুর ক্ষেত্রে ও অনুরূপ ব্যবস্থা নিতে হবে । "));
            db.addContact(new Contact(522,"থেমে থেমে বেশ জোরে  বৃষ্টি হতে পারে। সেক্ষেত্রে  বাড়তি সেচ দেবার প্রয়োজন পড়বেনা। পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । গবাদিপশুর ক্ষেত্রে ও অনুরূপ ব্যবস্থা নিতে হবে । "));

            db.addContact(new Contact(951,"মৃদু আরামদায়ক বাতাস থাকবে । আবহাওয়া সব ধরনের কৃষি কাজের জন্য উপযুক্ত থাকবে । "));
            db.addContact(new Contact(952,"মৃদু আরামদায়ক বাতাস থাকবে । আবহাওয়া সব ধরনের কৃষি কাজের জন্য উপযুক্ত থাকবে । "));
            db.addContact(new Contact(953,"মৃদু আরামদায়ক বাতাস থাকবে । আবহাওয়া সব ধরনের কৃষি কাজের জন্য উপযুক্ত থাকবে । "));
            db.addContact(new Contact(954,"মৃদু আরামদায়ক বাতাস থাকবে । আবহাওয়া সব ধরনের কৃষি কাজের জন্য উপযুক্ত থাকবে । "));

            db.addContact(new Contact(900,"টর্নেডো হতে পারে। সরবোচ্চ সতর্কতা অবলম্বন করুন ! "));
            db.addContact(new Contact(903,"প্রচণ্ড শীত পরতে পারে !  "));
            db.addContact(new Contact(904,"প্রচণ্ড গরম পরতে পারে !   "));

            db.addContact(new Contact(531,"থেমে থেমে বেশ জোরে  বৃষ্টি হতে পারে। সেক্ষেত্রে  বাড়তি সেচ দেবার প্রয়োজন পড়বেনা। পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । গবাদিপশুর ক্ষেত্রে ও অনুরূপ ব্যবস্থা নিতে হবে । "));
            db.addContact(new Contact(500,"হাল্কা বৃষ্টি হতে পারে। সেক্ষেত্রে  বাড়তি সেচ দেবার প্রয়োজন পড়বেনা। পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । গবাদিপশুর ক্ষেত্রে ও অনুরূপ ব্যবস্থা নিতে হবে । "));
            db.addContact(new Contact(501,"হাল্কা বৃষ্টি হতে পারে। সেক্ষেত্রে  বাড়তি সেচ দেবার প্রয়োজন পড়বেনা। পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । গবাদিপশুর ক্ষেত্রে ও অনুরূপ ব্যবস্থা নিতে হবে । "));
            db.addContact(new Contact(502,"বেশ জোরে  বৃষ্টি হতে পারে। সেক্ষেত্রে  বাড়তি সেচ দেবার প্রয়োজন পড়বেনা। পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । গবাদিপশুর ক্ষেত্রে ও অনুরূপ ব্যবস্থা নিতে হবে ।"));
            db.addContact(new Contact(503,"বেশ জোরে  বৃষ্টি হতে পারে। সেক্ষেত্রে  বাড়তি সেচ দেবার প্রয়োজন পড়বেনা। পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । গবাদিপশুর ক্ষেত্রে ও অনুরূপ ব্যবস্থা নিতে হবে ।"));
            db.addContact(new Contact(504,"বেশ জোরে  বৃষ্টি হতে পারে। সেক্ষেত্রে  বাড়তি সেচ দেবার প্রয়োজন পড়বেনা। পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । গবাদিপশুর ক্ষেত্রে ও অনুরূপ ব্যবস্থা নিতে হবে ।"));
            db.addContact(new Contact(520,"বেশ জোরে  বৃষ্টি হতে পারে। সেক্ষেত্রে  বাড়তি সেচ দেবার প্রয়োজন পড়বেনা। পানি জমে গেলে নালা কেটে পানি প্রবাহের ব্যবস্থা করতে হবে। খামারের মুরগিগুলোর ছাউনি ভালভাবে ঢাকা আছে কিনা খেয়াল রাখতে হবে । গবাদিপশুর ক্ষেত্রে ও অনুরূপ ব্যবস্থা নিতে হবে ।"));
            db.addContact(new Contact(800,"আজকের আকাশ বেশ পরিষ্কার । আবহাওয়া সব ধরনের কৃষি কাজের জন্য উপযুক্ত থাকবে  । বাড়তি সেচ দেবার প্রয়োজন পড়বেনা। খামারের মুরগিগুলোর সাধারণ পরিচর্যা করলেই চলবে। মাছ কে সাধারণ খাবার সহ নিয়মিত পরিচর্যা করুন । গবাদি পশুদেরকে নিশ্চিন্তে  ছেড়ে দিয়ে আসতে পারেন ।" ));
            db.addContact(new Contact(801,"আজকের আকাশে কিছুটা মেঘ দেখা যাচ্ছে , বৃষ্টির আশঙ্কা আছে । সামান্য কুয়াশা পড়তে পারে( শীতকালের ক্ষেত্রে ) । বাড়তি সেচ দেবার প্রয়োজন পড়বেনা। খামারের মুরগিগুলোর সাধারণ পরিচর্যা করলেই চলবে। "));
            db.addContact(new Contact(802,"আজকের আকাশে কিছুটা মেঘ দেখা যাচ্ছে  যা বিভিন্ন যায়গায় ছড়িয়ে , সুতরাং বিভিন্ন স্থানে আলাদা সময়ে বৃষ্টি / মেঘের আশঙ্কা আছে । সামান্য কুয়াশা পড়তে পারে( শীতকালের ক্ষেত্রে ) । বাড়তি সেচ দেবার প্রয়োজন পড়বেনা। খামারের মুরগিগুলোর সাধারণ পরিচর্যা করলেই চলবে।  "));
            db.addContact(new Contact(803,"আকাশে মেঘ দেখা যেতে পারে যা অর্ধেকের বেশি জুড়ে থাকবে। সামান্য অস্বস্তি  অনুভূত হতে পারে এবং আপনার এলাকাসহ আরও কিছু জায়গায় বৃষ্টি হতে পারে ।  বাড়তি সেচ দেবার প্রয়োজন পড়বেনা।  খামারের মুরগিগুলোর সাধারণ পরিচর্যা করলেই চলবে।"));
            db.addContact(new Contact(804,"আকাশে মেঘ দেখা যেতে পারে যা প্রায় পুরো আকাশ জুড়ে থাকবে। সামান্য অস্বস্তি  অনুভূত হতে পারে এবং আপনার এলাকাসহ আরও কিছু জায়গায় বৃষ্টি হতে পারে ।  বাড়তি সেচ দেবার প্রয়োজন পড়বেনা।  খামারের মুরগিগুলোর ভালভাবে ঢেকে রেখে পরিচর্যা করলেই চলবে। গবাদি পশুগুলো সময়মত ফিরিয়ে নিয়ে আসুন । "));
        }


        List<Contact> contacts = db.getAllContacts(id);
        // textView.setText("\ni = " + i);
        String log="";
        int i = 0;
        for (Contact cn : contacts)
        {
            i++;
            if(i==1)
            {
                log +=cn.getDescription();
            }

            // Writing Contacts to log
            // Log.d("Name: ", log);

        }

        textView.setText(log);
    }


}
